# Польские нотации (Polish Notations)

Реализации вычисления арифметических выражений в польской нотации.

## Что такое польская нотация?

**Польская нотация** - способ записи арифметических выражений, не требующий скобок. Вместо привычной инфиксной записи (оператор между операндами), используется префиксная или постфиксная форма.

## Файлы

### `poliz.c` - Обратная польская запись (Postfix / RPN)

**Формат:** операнды перед оператором

```
Инфиксная:  3 + 4
Postfix:    3 4 +

Инфиксная:  (5 + 1 * 2) * 4 - 3
Postfix:    5 1 2 * + 4 * 3 -
```

**Алгоритм вычисления:**
1. Читаем выражение **слева направо**
2. Если встречаем число → кладём в стек
3. Если встречаем оператор → достаём 2 числа, вычисляем, результат в стек
4. В конце в стеке остаётся результат

**Функция:**
```c
int Poliz(char *expression)
```

**Пример работы для `"3 4 +"`:**
```
Символ | Стек       | Действие
-------|------------|------------------
3      | [3]        | Число → в стек
4      | [3, 4]     | Число → в стек
+      | [7]        | Достали 4 и 3, 3+4=7
Результат: 7
```

**Пример работы для `"5 1 2 + 4 * + 3 -"`:**
```
Символ | Стек           | Действие
-------|----------------|------------------
5      | [5]            | Число
1      | [5, 1]         | Число
2      | [5, 1, 2]      | Число
+      | [5, 3]         | 1+2=3
4      | [5, 3, 4]      | Число
*      | [5, 12]        | 3*4=12
+      | [17]           | 5+12=17
3      | [17, 3]        | Число
-      | [14]           | 17-3=14
Результат: 14
```

**Сложность:**
- Время: O(n) - один проход
- Память: O(n) - стек

---

### `polpz.c` - Прямая польская запись (Prefix)

**Формат:** оператор перед операндами

```
Инфиксная:  3 + 4
Prefix:     + 3 4

Инфиксная:  5 + (1+2)*4 - 3
Prefix:     - + 5 * + 1 2 4 3
```

**Алгоритм вычисления:**
1. Читаем выражение **справа налево** ⚠️
2. Если встречаем число → кладём в стек
3. Если встречаем оператор → достаём 2 числа в **прямом порядке**, вычисляем
4. В конце в стеке остаётся результат

**Функция:**
```c
int PolPZ(char *expression)
```

**Пример работы для `"+ 3 4"`:**
```
Символ | Стек       | Действие (читаем справа)
-------|------------|-------------------------
4      | [4]        | Число → в стек
3      | [4, 3]     | Число → в стек
+      | [7]        | Достали 3 и 4, 3+4=7
Результат: 7
```

**Ключевое отличие от Postfix:**
- Чтение **справа налево**
- Порядок операндов **прямой** (a, b вместо b, a)

**Сложность:**
- Время: O(n) - один проход
- Память: O(n) - стек

---

## Сравнение форм записи

| Форма | Пример | Чтение | Порядок операндов |
|-------|--------|--------|-------------------|
| Инфиксная | `(3 + 4) * 5` | - | - |
| Постфиксная (RPN) | `3 4 + 5 *` | Слева направо | b, a |
| Префиксная | `* + 3 4 5` | Справа налево | a, b |

## Преимущества польских нотаций

✅ **Не требуют скобок** - приоритет операций определён порядком
✅ **Эффективное вычисление** - один проход, O(n)
✅ **Простая реализация** - нужен только стек
✅ **Используются в реальных системах**:
   - Калькуляторы HP (RPN)
   - Компиляторы (промежуточное представление)
   - Forth, PostScript, Lisp

## Применение

### Где используется Postfix (RPN)?
- Калькуляторы HP и научные калькуляторы
- Компиляторы (генерация кода для стековых машин)
- Язык Forth
- PostScript (язык описания страниц)

### Где используется Prefix?
- Lisp и его диалекты
- Математическая запись (функции: `sin(x)` ≈ `sin x`)
- Некоторые калькуляторы

## Компиляция и запуск

```bash
# Обратная польская запись
gcc poliz.c -o poliz
./poliz

# Прямая польская запись
gcc polpz.c -o polpz
./polpz
```

**Примечание:** Раскомментируйте функцию `main()` в файлах перед компиляцией.

## Примеры использования

### Postfix (RPN)
```c
char expr1[] = "3 4 +";
printf("%d\n", Poliz(expr1));  // 7

char expr2[] = "5 1 2 + 4 * + 3 -";
printf("%d\n", Poliz(expr2));  // 14 = 5+(1+2)*4-3

char expr3[] = "9 5 - 2 *";
printf("%d\n", Poliz(expr3));  // 8 = (9-5)*2
```

### Prefix
```c
char expr1[] = "+ 3 4";
printf("%d\n", PolPZ(expr1));  // 7

char expr2[] = "- + + 5 * + 1 2 4 3";
printf("%d\n", PolPZ(expr2));  // 14 = 5+(1+2)*4-3

char expr3[] = "* - 9 5 2";
printf("%d\n", PolPZ(expr3));  // 8 = (9-5)*2
```

## Преобразование между формами

### Инфиксная → Postfix (алгоритм Шантинг-Ярд)
```
Инфиксная:  3 + 4 * 2
Postfix:    3 4 2 * +

Правила:
1. Операнды → сразу в выход
2. Операторы → в стек с учётом приоритета
3. Скобки управляют порядком
```

### Инфиксная → Prefix
```
Инфиксная:  3 + 4 * 2
Prefix:     + 3 * 4 2

Метод: обработать инфиксную справа налево
```

## Таблица преобразований

| Инфиксная | Prefix | Postfix |
|-----------|--------|---------|
| `3 + 4` | `+ 3 4` | `3 4 +` |
| `3 * 4 + 5` | `+ * 3 4 5` | `3 4 * 5 +` |
| `3 + 4 * 5` | `+ 3 * 4 5` | `3 4 5 * +` |
| `(3 + 4) * 5` | `* + 3 4 5` | `3 4 + 5 *` |
| `3 * (4 + 5)` | `* 3 + 4 5` | `3 4 5 + *` |

## Ресурсы

- [Обратная польская запись - Wikipedia](https://ru.wikipedia.org/wiki/Обратная_польская_запись)
- [Польская нотация - Wikipedia](https://ru.wikipedia.org/wiki/Польская_нотация)
- [RPN Calculator](https://www.calculator.org/rpn.aspx)
- [Shunting Yard Algorithm](https://www.geeksforgeeks.org/stack-set-2-infix-to-postfix/)

